DAY13
https://rfriend.tistory.com/389?category=675917

In [1]:
import pandas as pd
import numpy as np

# 과제 1

In [6]:
abalone = pd.read_csv('abalone.txt', names = ['sex', 'length', 'diameter', 'height', 
                               'whole_weight', 'shucked_weight', 'viscera_weight', 
                               'shell_weight', 'rings'],header=None)
abalone.head()

,sex,length,diameter,height,whole_weight,shucked_weight,viscera_weight,shell_weight,rings
0,M,0.455,0.365,0.095,0.5140,0.2245,0.1010,0.150,15
1,M,0.350,0.265,0.090,0.2255,0.0995,0.0485,0.070,7
2,F,0.530,0.420,0.135,0.6770,0.2565,0.1415,0.210,9
3,M,0.440,0.365,0.125,0.5160,0.2155,0.1140,0.155,10
4,I,0.330,0.255,0.080,0.2050,0.0895,0.0395,0.055,7

In [7]:
abalone['length_cat'] = np.where(abalone.length > np.median(abalone.length), 'length_long', 'length_short')

In [9]:
abalone.head(10)

,sex,length,diameter,height,whole_weight,shucked_weight,viscera_weight,shell_weight,rings,length_cat
0,M,0.455,0.365,0.095,0.5140,0.2245,0.1010,0.150,15,length_short
1,M,0.350,0.265,0.090,0.2255,0.0995,0.0485,0.070,7,length_short
2,F,0.530,0.420,0.135,0.6770,0.2565,0.1415,0.210,9,length_short
3,M,0.440,0.365,0.125,0.5160,0.2155,0.1140,0.155,10,length_short
4,I,0.330,0.255,0.080,0.2050,0.0895,0.0395,0.055,7,length_short
5,I,0.425,0.300,0.095,0.3515,0.1410,0.0775,0.120,8,length_short
6,F,0.530,0.415,0.150,0.7775,0.2370,0.1415,0.330,20,length_short
7,F,0.545,0.425,0.125,0.7680,0.2940,0.1495,0.260,16,length_short
8,M,0.475,0.370,0.125,0.5095,0.2165,0.1125,0.165,9,length_short
9,F,0.550,0.440,0.150,0.8945,0.3145,0.1510,0.320,19,length_long

In [12]:
for sex, group_data in abalone[['sex', 'length_cat', 'whole_weight', 'rings']].groupby('sex'):
    print(sex)
    print(group_data[:5])

F
   sex    length_cat  whole_weight  rings
2    F  length_short        0.6770      9
6    F  length_short        0.7775     20
7    F  length_short        0.7680     16
9    F   length_long        0.8945     19
10   F  length_short        0.6065     14
I
   sex    length_cat  whole_weight  rings
4    I  length_short        0.2050      7
5    I  length_short        0.3515      8
16   I  length_short        0.2905      7
21   I  length_short        0.2255     10
42   I  length_short        0.0700      5
M
   sex    length_cat  whole_weight  rings
0    M  length_short        0.5140     15
1    M  length_short        0.2255      7
3    M  length_short        0.5160     10
8    M  length_short        0.5095      9
11   M  length_short        0.4060     10

In [16]:
for (sex, length_cat), group_data in abalone[['sex', 'length_cat', 'whole_weight', 'rings']].groupby(['sex', 'length_cat']):
    print(sex, length_cat)
    print(group_data[:5])

F length_long
   sex   length_cat  whole_weight  rings
9    F  length_long        0.8945     19
22   F  length_long        0.9395     12
23   F  length_long        0.7635      9
24   F  length_long        1.1615     10
25   F  length_long        0.9285     11
F length_short
   sex    length_cat  whole_weight  rings
2    F  length_short        0.6770      9
6    F  length_short        0.7775     20
7    F  length_short        0.7680     16
10   F  length_short        0.6065     14
13   F  length_short        0.6845     10
I length_long
    sex   length_cat  whole_weight  rings
509   I  length_long        0.8735     16
510   I  length_long        1.1095     10
549   I  length_long        0.8750     11
550   I  length_long        1.1625     17
551   I  length_long        0.9885     13
I length_short
   sex    length_cat  whole_weight  rings
4    I  length_short        0.2050      7
5    I  length_short        0.3515      8
16   I  length_short        0.2905      7
21   I  length_short        0.2255     10
42   I  length_short        0.0700      5
M length_long
   sex   length_cat  whole_weight  rings
27   M  length_long        0.9310     12
28   M  length_long        0.9365     15
29   M  length_long        0.8635     11
30   M  length_long        0.9975     10
32   M  length_long        1.3380     18
M length_short
   sex    length_cat  whole_weight  rings
0    M  length_short        0.5140     15
1    M  length_short        0.2255      7
3    M  length_short        0.5160     10
8    M  length_short        0.5095      9
11   M  length_short        0.4060     10

In [17]:
dict(list(abalone[:10][['sex', 'length_cat', 'whole_weight', 'rings']]
                              .groupby('sex')))

{'F':   sex    length_cat  whole_weight  rings
 2   F  length_short        0.6770      9
 6   F  length_short        0.7775     20
 7   F  length_short        0.7680     16
 9   F   length_long        0.8945     19,
 'I':   sex    length_cat  whole_weight  rings
 4   I  length_short        0.2050      7
 5   I  length_short        0.3515      8,
 'M':   sex    length_cat  whole_weight  rings
 0   M  length_short        0.5140     15
 1   M  length_short        0.2255      7
 3   M  length_short        0.5160     10
 8   M  length_short        0.5095      9}

# 과제 2

In [18]:
df = pd.DataFrame({'name': ['kim', 'KIM', 'Kim', 'lee', 'LEE', 'Lee', 'wang', 'hong'], 
                'value': [1, 2, 3, 4, 5, 6, 7, 8], 
                'value_2': [100, 300, 200, 100, 100, 300, 50, 80]
               })

In [19]:
df

   name  value  value_2
0   kim      1      100
1   KIM      2      300
2   Kim      3      200
3   lee      4      100
4   LEE      5      100
5   Lee      6      300
6  wang      7       50
7  hong      8       80

In [20]:
name_mapping = {
    'KIM': 'kim',
    'Kim': 'kim', 
    'LEE': 'lee', 
    'Lee': 'lee', 
    'wang': 'others', 
    'hong': 'others'
}

In [21]:
func = lambda x: name_mapping.get(x, x)
func

In [22]:
df['name_2'] = df['name'].map(func)

In [23]:
df

   name  value  value_2  name_2
0   kim      1      100     kim
1   KIM      2      300     kim
2   Kim      3      200     kim
3   lee      4      100     lee
4   LEE      5      100     lee
5   Lee      6      300     lee
6  wang      7       50  others
7  hong      8       80  others

In [25]:
df.groupby('name_2').sum()

        value  value_2
name_2
kim         6      600
lee        15      500
others     15      130

# 과제 3

In [26]:
df = pd.DataFrame({'id': [1, 2, 10, 20, 100, 200], 
                   'name': ['aaa', 'bbb', 'ccc', 'ddd', 'eee', 'fff']})
df

    id name
0    1  aaa
1    2  bbb
2   10  ccc
3   20  ddd
4  100  eee
5  200  fff

In [27]:
df['id_2'] = df['id'].apply(lambda x: "{:0>5d}".format(x))
df

    id name   id_2
0    1  aaa  00001
1    2  bbb  00002
2   10  ccc  00010
3   20  ddd  00020
4  100  eee  00100
5  200  fff  00200

In [29]:
df['id_name'] = df[['id_2', 'name']].apply(lambda x:'_'.join(x), axis=1)
df

    id name   id_2    id_name
0    1  aaa  00001  00001_aaa
1    2  bbb  00002  00002_bbb
2   10  ccc  00010  00010_ccc
3   20  ddd  00020  00020_ddd
4  100  eee  00100  00100_eee
5  200  fff  00200  00200_fff

# 과제 4

In [30]:
df = pd.DataFrame(data=np.arange(20).reshape(4, 5),
               columns = ['c1', 'c2', 'c3', 'c4', 'c5'], 
               index = ['r1', 'r2', 'r3', 'r4'])
df

    c1  c2  c3  c4  c5
r1   0   1   2   3   4
r2   5   6   7   8   9
r3  10  11  12  13  14
r4  15  16  17  18  19

In [32]:
mapping_dict_row = {
    'r1': 'row_g1',
    'r2': 'row_g1',
    'r3': 'row_g2',
    'r4': 'row_g2'
}
df.groupby(mapping_dict_row).sum()

        c1  c2  c3  c4  c5
row_g1   5   7   9  11  13
row_g2  25  27  29  31  33

In [37]:
 mapping_dict_col = {'c1': 'col_g1', 
                   'c2': 'col_g1', 
                   'c3': 'col_g2', 
                   'c4': 'col_g2', 
                   'c5': 'col_g2'}
df.groupby(mapping_dict_col, axis=1).sum()

    col_g1  col_g2
r1       1       9
r2      11      24
r3      21      39
r4      31      54

In [38]:
 hier_columns = pd.MultiIndex.from_arrays([['col_g1', 'col_g1', 'col_g2', 'col_g2', 'col_g2'],
                                         ['c1', 'c2', 'c3', 'c4', 'c5']], 
                                        names = ['col_level_1', 'col_level_2'])

In [40]:
hier_df = pd.DataFrame(data = np.arange(20).reshape(4,5), 
                   columns = hier_columns, 
                   index = ['r1', 'r2', 'r3', 'r4'])
hier_df

col_level_1 col_g1     col_g2
col_level_2     c1  c2     c3  c4  c5
r1               0   1      2   3   4
r2               5   6      7   8   9
r3              10  11     12  13  14
r4              15  16     17  18  19

In [41]:
hier_df.groupby(level = 'col_level_1', axis=1).mean()

col_level_1  col_g1  col_g2
r1              0.5     3.0
r2              5.5     8.0
r3             10.5    13.0
r4             15.5    18.0

# 과제 5

In [42]:
df = pd.DataFrame({'group': ['a', 'a', 'a', 'b', 'b', 'b'], 
                   'value_1': np.arange(6), 
                   'value_2': np.random.randn(6)})
df

  group  value_1   value_2
0     a        0 -0.873456
1     a        1 -1.838954
2     a        2 -1.338087
3     b        3  0.643153
4     b        4 -1.083612
5     b        5  0.511560

In [44]:
df.groupby('group').count()

       value_1  value_2
group
a            3        3
b            3        3

In [45]:
df.groupby('group').min()

       value_1   value_2
group
a            0 -1.838954
b            3 -1.083612

In [46]:
df.groupby('group').max()

       value_1   value_2
group
a            2 -0.873456
b            5  0.643153

In [47]:
df.groupby('group').quantile()

       value_1   value_2
group
a          1.0 -1.338087
b          4.0  0.511560